{"en":{
"global":{
"Databáze překladových ekvivalentů":"Translation Equivalents Database",
"treq_logo_v2.svg":"treq_logo_en_v2.svg",
"Ano":"Yes",
"Ne":"No",
"Jazyk":"Language",
"Lemmata":"Lemma",
"Víceslovné":"Multiword",
"Dotaz":"Query",
"Regulární":"RegEx",
"A = a":"A = a",
"Čeština":"Czech",
"Angličtina":"English",
"Omezit na":"Restrict to",
"Hledej":"Search",
"Setřídit podle frekvence, vzestupně":"Sort by frequency, ascending",
"Frekvence":"Frequency",
"Procenta":"Proportion",
"Setřídit podle procent, vzestupně":"Sort by proportion, ascending",
"Setřídit podle procent, sestupně":"Sort by proportion, descending",
"Setřídit podle frekvence, sestupně":"Sort by frequency, descending",
"Setřídit podle - Čeština, vzestupně":"Sort by Czech, ascending",
"Setřídit podle - Čeština, sestupně":"Sort by Czech, descending",
"Setřídit podle":"Sort by",
"vzestupně":"ascending",
"sestupně":"descending",
"ÚČNK":"ICNC",
"Nahlásit chybu":"Report bug",
"Nevíte, jak nejlépe přeložit nějaké slovo? Potřebujete vymyslet vhodné synonymum? Zkuste Treq! Treq je sbírka oboustranných česko-cizojazyčných a anglicko-cizojazyčných slovníků, vytvořených automaticky z paralelního korpusu InterCorp.":"Are you wondering how to best translate a word? Do you need to come up with a synonym or other suitable expression? Try Treq! Treq is a collection of bilingual Czech/English-foreign language dictionaries, built automatically from the InterCorp parallel corpus.",
"Nejdříve zvolíme výchozí jazyk, v němž je hledaný výraz, a cílový jazyk, do něhož jej chceme přeložit. Slovo můžeme zadat v konkrétním tvaru, v základním slovníkovém tvaru (Lemmata), lze vyhledávat i víceslovnou jednotku (Víceslovné), využít při hledání regulární výrazy (Regulární) nebo v dotazu nerozlišovat velikost písmen (A = a). Můžeme si také vybrat, zda má být výsledek založen na překladech beletristického jádra, jednotlivých kolekcí, nebo všech textů v InterCorpu (Omezit na:). Pak slovo zadáme (Dotaz:) a klikneme na Hledej. Výsledkem dotazu je seznam nalezených překladů zadaného slova, defaultně setříděných sestupně podle frekvence. Pro ověření výskytu v kontextu je možné si dvojici výrazů vyhledat dotazem do korpusu InterCorp kliknutím na ekvivalent. Počet výskytů se však může lišit – paralelní dotaz najde i konkordance, v nichž potenciální ekvivalent odpovídá jinému slovu.":"To use Treq, start by specifying the desired language pair by selecting source language (the language of the query) and target language (the language of the potential equivalents). The query can be entered either as a specific word form, as a lemma (Lemma), as a multiword unit (Multiword) or using regular expressions (Regex). The query can also be made case insensitive (A = a). Depending on the (Restrict to:) parameter, result retrieval can target different text types: the fiction-oriented core texts, specific collections, or the entire corpus. Then enter your query (Query:) and click Search. The query result is a list of all translation candidates of the given word, sorted by decreasing frequency by default. By clicking on a particular candidate, you can browse its occurrences in InterCorp and check the translation contexts. The reported frequency may differ since the corpus query may also find instances where the potential equivalent corresponds to a different word.",
"Treq vychází z textů 9. vydání paralelního korpusu InterCorp. Originální a překladové texty jsou nejprve na základě statistických výpočtů zarovnány po slovech pomocí programu GIZA++ ":"Treq is based on texts from InterCorp, release 9. The first step was to align the original and translated texts word-to-word using statistical methods provided by the GIZA++ program ",
"Zarovnané dvojice slov jsou pak setříděny a sumarizovány. Výsledek automatické excerpce není nijak revidován, jako ukazatel relevance překladového ekvivalentu však může posloužit relativní frekvence příslušné dvojice slov. Čím častěji se ekvivalent zadaného slova vyskytl ve srovnání s ostatními ekvivalenty, tím větší je pravděpodobnost, že je funkční.":"The aligned word pairs were then sorted and summarized. The results of the automatic excerption were not reviewed; however, the relative frequency of a given pair may serve as an approximate indicator of reliability. The more often an equivalent of a given word occurs in comparison with other equivalents, the more useful it may be.",
"Co je to lemma?":"What is lemma?",
"Které jazyky jsou lemmatizované?":"What languages are lemmatized?",
"Co je to jádro a co jsou to kolekce?":"What is core and what are collections?",
"Zavřít":"Close",
"Info o verzi":"Version Info",
"Ver.":"Ver.",
"Nápověda":"Help",
"Datum zveřejnění":"Release date",
"září":"September",
"srpen":"August",
"říjen":"October",
"leden":"January",
"březen":"March",
"drobné úpravy rozhraní a oficiální zveřejnění":"final inteface polish and official release",
"prohledávání výsledků z jádra Intercorpu":"searching through results from Core of Intercorp",
"doplnění dat z dalších částí Intercorpu (balíčky)":"adding the data from other parts of Intercorp (collections)",
"nový design uživatelského prostředí":"user interface redesigned",
"integrace do lišty nástrojů ÚČNK na portálu korpus.cz":"Integration of Treq in to the toolbar at korpus.cz main page",
"překlad rozhraní do angličtiny":"English translation of the Interface",
"odkazy na adekvátní dotaz do Kontextu":"links to the respective queries in Kontext concordancer",
"doplněn sloupeček procenta v tabulce výsledků":"added the proportion column in the result table",
"logování dotazů":"searchs logging",
"přepracován výběr jazyků dotazu a výsledku":"redesigned language selection",
"přidány anglicko-cizojazyčné slovníky":"addition of English-foreign dictionaries",
"přidány slovníky s víceslovnými jednotkami":"addition of multiword expressions",
"přibyla možnost vybírat skupiny kolekcí":"you can newly choose any or all collections",
"ke kladení dotazu lze použít regulární výrazy":"you can now use RegEx expressions",
"lze ignorovat velká/malá písma v dotazu":"option to ignore case of the query",
"přibyl součet výskytů na konci seznamu":"sum of all frequencies at the bottom",
"Kdo Treq vyvíjí?":"Who are Treq developers?",
"Návrh a realizace":"Design and implementation",
"Nástroj pro zarovnání slov a extrakci slovních párů":"Tools for word-to-word alignment and wordpairs extraction",
", s díky Ondřeji Bojarovi a Davidu Marečkovi za pomoc s instalací. Výsledek automatické excerpce už nebyl nijak revidován.":". Our thanks are due to Ondřej Bojar and David Mareček for advice on the installation. The results of the automatic excerption were not reviewed",
"Za podněty k vývoji trequ vděčíme Elżbietě Kaczmarské.":"We are grateful to Elżbieta Kaczmarska for inciting the development of treq.",
"Uživatelské rozhraní":"User interface",
"Příprava dat":"Data extraction",
"Grafická podpora":"Design support",
"Jak citovat Treq":"How to cite Treq",
"Dostupný z WWW":"Available on WWW",
"Škrabal, M. – Vavřín, M. (2017): Databáze překladových ekvivalentů Treq. Časopis pro moderní filologii 99&nbsp;(2), s. 245–260.":"Škrabal, M. – Vavřín, M. (2017): Databáze překladových ekvivalentů Treq. Časopis pro moderní filologii 99&nbsp;(2), s. 245–260.",
"Není ve slovníku.":"No results",
"---":"---",
"Výchozí jazyk":"Source language",
"Cílový jazyk":"Target language",
"Vyber vše":"Check all",
"Odeber vše":"Uncheck All",
"Vyber kolekce":"Choose collection",
"Kolekce: #":"Collection(s): #",
"Hledaný text...":"Search text...",
"nalezeno":"matched",
"Omezit hledání na jádro/kolekce":"Restrict search to core/collections",
"Vyberte typy dat, které chcete zahrnout do prohledávání.":"Choose the type of data to be included in your search.",
"Vyhledávat v lemmatizované verzi databáze":"Search in the lemmatized version of the database",
"Při zaškrtnutí pracuje se základními slovníkovými tvary slov (<i>kočka-cat, hezký-hübsch, psát-pisać</i>) na rozdíl od nelemmatizované verze (<i>kočky-cats, hezkého-hübschen, psal jsem-pisałem</i>).":"With this option checked, Treq will use dictionary forms both for the search and results (<i>cat-Katze, nice-gentil, sing-cantar</i>) unlike the non-lemmatized option (<i>cats-Katzen, nicer-plus gentil, sang-cantaban</i>).",
"Zahrnout víceslovné jednotky":"Include multiword expressions",
"Při zaškrtnutí pracuje s verzí databáze, která obsahuje i víceslovné jednotky. (Upozornění: Při vyhledávání víceslovných jednotek je nutné počítat se zvýšenou mírou chybovosti.)":"With this option checked, Treq will search a different database which includes multiword expresions. (Note: This type of querying has a higher error rate.)",
"Použít regulární výrazy v dotazu":"Use regular expressions in the query",
"Regulární výrazy jsou speciální znaky se zvláštním významem (např. tečka zastupuje jeden libovolný znak), které umožňují klást složitější typy dotazů. (Upozornění: Oproti běžnému dotazu může jejich vyhodnocování trvat déle.). I bez zaškrtnutí této volby lze použít znak % pro libovolné slovo nebo jeho část (např. <i>hezk%</i> najde tvary: <i>hezký, hezká, hezké, hezkou, hezkými, hezky aj.</i>).":"Regular expresions are special characters with a specific function (e.g. a dot stands for any one character) enabling complex querying. (Note: The results may take longer to compute.) Without checking this option, you can still use '%' as a substitute for a word or a word part (<i>sing%</i> finds the following word forms: <i>singing, sings, singer etc.</i>)",
"Nerozlišovat velikost písmen v dotazu":"Case insensitive query",
"Při zaškrtnutí budou na dotaz <i>kočka</i> nalezena slova <i>kočka, Kočka, KOČKA atp.</i>":"With this option checked, Treq will return all forms of the word regardless of the capitalization (<i>cat</i> will find <i>CAT, Cat etc.</i>).",
"Které regulární výrazy mohu v Trequ použít?":"Which regular expressions can I use in Treq?"
}}}
